app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
def index
  @posts = Post.all.order('created_at DESC')

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First post"], ["body", "Lorem ipsum"], ["created_at", 2016-09-07 22:26:07 UTC], ["updated_at", 2016-09-07 22:26:07 UTC]]
---
def create
  @post = Post.new(post_params)
  @post.save